# -*- coding: utf-8 -*-

# Вывести на консоль жителей комнат (модули room_1 и room_2)
# Формат: В комнате room_1 живут: ...

# TODO здесь ваш код

from room_1 import folks as folks1
from room_2 import folks as folks2
room_1_pipl = folks1
room_2_pipl = folks2

print('В комнате 1 живут = ' ,room_1_pipl)
print('В комнате 2 живут = ' ,room_2_pipl)


